Yr8/8-CS-Cryptography/pages/4_Lesson.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Cryptography</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">Cryptography</h1>
  <div class="github-fork-ribbon-wrapper left">
    <div class="github-fork-ribbon">
      <a href="https://github.com/MarcScott/8-CS-Cryptography">Fork me on GitHub</a>
    </div>
  </div>
<div id="stickyribbon">
    <ul>
      <li><a href="1_Lesson.html">Week1</a></li>
      <li><a href="2_Lesson.html">Week2</a></li>
      <li><a href="3_Lesson.html">Week3</a></li>
      <li><a href="4_Lesson.html">Week4</a></li>
      <li><a href="5_Lesson.html">Week5</a></li>
      <li><a href="6_Lesson.html">Week6</a></li>
      <li><a href="assessment.html">Assessment</a></li>

    </ul>
  </div>
<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1"><span class="section-number-2">1</span> Cracking the Caesar Cipher</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 learn">
<h3 id="sec-1-1">Learn It</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Last lesson you learned about how <span class="underline">not</span> to store passwords, and the problem with the MD5 hashing algorithm.
</li>
<li>It's trivial for a cracker to figure out your password, just by looking up the MD5 hash on Google.
</li>
<li>As most people stupidly use the same password for many sites, the cracker would probably then have their main password.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3 learn">
<h3 id="sec-1-2">Learn It</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>One of the best ways of learning how to stop crackers, is to learn how they are able to attack encryption schemes.
</li>
<li>We'll start of by learning how to crack the Caesar Cipher.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3 try">
<h3 id="sec-1-3">Try It</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Here's a message that has been encrypted using the Caesar Cipher.
</li>
</ul>
<pre class="example">
odmhxf dmzqa, ljqruh wkrvh iluvw wzr zrugv wkhb duh mxvw wkhuh wr frqixvh d fudfnhu.
dqbzdb wkh vhfuhw phvvdjh lv, qrergb hashfwv wkh vsdqlvk lqtxlvlwlrq
</pre>
<ul class="org-ul">
<li>Can you figure out what the message says? 
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3 code">
<h3 id="sec-1-4">Code It</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Given enough time, you could probably decrypt the message, but it could take you awhile.
</li>
<li>A computer can do it pretty quickly though.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3 code">
<h3 id="sec-1-5">Code It</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Let's start with a couple of variables with the information we need.
</li>
<li>Open up a new python file (CC-crack.py) in IDLE and add the following lines of code.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">alphabet</span> = <span style="color: #2aa198;">'abcdefghijklmnopqrstuvwxyz'</span>
<span style="color: #6c71c4;">cipherText</span> = <span style="color: #2aa198;">'''odmhxf dmzqa, ljqruh wkrvh iluvw wzr zrugv wkhb duh mxvw wkhuh wr </span>
<span style="color: #2aa198;">frqixvh d fudfnhu. dqbzdb wkh vhfuhw phvvdjh lv,</span>
<span style="color: #2aa198;">qrergb hashfwv wkh vsdqlvk lqtxlvlwlrq'''</span>
</pre>
</div>
<ul class="org-ul">
<li>In Python, if we want a multiline string, we use three quotes '''
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3 design">
<h3 id="sec-1-6">Design It</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>The algorithm for this isn't too complicated.
</li>
<li>We're basically going to try all 25 possible shift values on the secret message.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-7" class="outline-3 learn">
<h3 id="sec-1-7">Learn It</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>We've used a <code>for</code> loop before to <i>iterate</i> over a string of characters.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">text</span> = <span style="color: #2aa198;">'the quick brown fox jumped over the lazy dog'</span>
<span style="color: #859900;">for</span> letter <span style="color: #859900;">in</span> text:
    <span style="color: #859900;">print</span>(letter)
</pre>
</div>
<ul class="org-ul">
<li>But we can also use for loops to iterate over a range of numbers
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #859900;">for</span> i <span style="color: #859900;">in</span> <span style="color: #6c71c4;">range</span>(10):
    <span style="color: #859900;">print</span>(i)

<span style="color: #859900;">for</span> i <span style="color: #859900;">in</span> <span style="color: #6c71c4;">range</span>(5,20):
    <span style="color: #859900;">print</span>(i)

<span style="color: #859900;">for</span> i <span style="color: #859900;">in</span> <span style="color: #6c71c4;">range</span>(10,100,5):
    <span style="color: #859900;">print</span>(i)

<span style="color: #859900;">for</span> i <span style="color: #859900;">in</span> <span style="color: #6c71c4;">range</span>(10,0,-1):
    <span style="color: #859900;">print</span>(i)

<span style="color: #859900;">for</span> i <span style="color: #859900;">in</span> <span style="color: #6c71c4;">range</span>(10,0,-1):
    <span style="color: #859900;">print</span>(i)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-8" class="outline-3 badge">
<h3 id="sec-1-8">Badge It - Silver</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li>Create a new file called forLoops.py
</li>
<li>For each of the <code>for</code> loops above, describe what they print out.
</li>
<li>Construct <code>for</code> loops to print out the following.
<ol class="org-ol">
<li>All the numbers from 1 to 1000
</li>
<li>All the even numbers from 100 to 200
</li>
<li>All the numbers going backwards from 500 to 0 that are divisible by 10
</li>
</ol>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-9" class="outline-3 code">
<h3 id="sec-1-9">Code It</h3>
<div class="outline-text-3" id="text-1-9">
<ul class="org-ul">
<li>Put these lines of code into your file.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #859900;">for</span> i <span style="color: #859900;">in</span> <span style="color: #6c71c4;">range</span>(1,26):
    <span style="color: #6c71c4;">plainText</span> = <span style="color: #2aa198;">''</span>
</pre>
</div>
<ul class="org-ul">
<li>This will give use all the shift values as the variable <code>i</code>
</li>
<li>It also creates an empty string, ready to build the decrypted text.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-10" class="outline-3 learn">
<h3 id="sec-1-10">Learn It</h3>
<div class="outline-text-3" id="text-1-10">
<ul class="org-ul">
<li>We now want to iterate over the letters in the cipherText.
</li>
<li>We can do this with another <code>for</code> loop.
</li>
<li>Placing one <code>for</code> loop inside another <code>for</code> loop is called <i>nesting</i>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-11" class="outline-3 code">
<h3 id="sec-1-11">Code It</h3>
<div class="outline-text-3" id="text-1-11">
<ul class="org-ul">
<li>Change your code so it looks like this.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">alphabet</span> = <span style="color: #2aa198;">'abcdefghijklmnopqrstuvwxyz'</span>
<span style="color: #6c71c4;">cipherText</span> = <span style="color: #2aa198;">'''odmhxf dmzqa, ljqruh wkrvh iluvw wzr zrugv wkhb duh mxvw wkhuh wr </span>
<span style="color: #2aa198;">frqixvh d fudfnhu. dqbzdb wkh vhfuhw phvvdjh lv,</span>
<span style="color: #2aa198;">qrergb hashfwv wkh vsdqlvk lqtxlvlwlrq'''</span>

<span style="color: #859900;">for</span> i <span style="color: #859900;">in</span> <span style="color: #6c71c4;">range</span>(1,26):
    <span style="color: #6c71c4;">plainText</span> = <span style="color: #2aa198;">''</span>
    <span style="color: #859900;">for</span> letter <span style="color: #859900;">in</span> cipherText:
        <span style="color: #6c71c4;">position</span> = alphabet.index(letter)
        <span style="color: #6c71c4;">shiftedIndex</span> = position + i
        <span style="color: #6c71c4;">shiftedLetter</span> = alphabet[shiftedIndex]
        <span style="color: #859900;">print</span>(shiftedLetter)
</pre>
</div>

<ul class="org-ul">
<li>When you run this code, you should get the following error
</li>
</ul>

<pre class="example">
Traceback (most recent call last):
  File "/path/to/file/filename.py", line 9, in &lt;module&gt;
    position = alphabet.index(letter)
ValueError: substring not found
</pre>
</div>
</div>

<div id="outline-container-sec-1-12" class="outline-3 try">
<h3 id="sec-1-12">Try It</h3>
<div class="outline-text-3" id="text-1-12">
<ul class="org-ul">
<li>So what has gone wrong?
</li>
<li>Let's use a trace table to figure it out.
</li>
<li>Trace tables, trace the values of variables in our code 
</li>
<li>The variables i, letter, position and shiftedLetter keep changing as the loop runs.
</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />

<col  class="right" />

<col  class="right" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="right">i</th>
<th scope="col" class="left">letter</th>
<th scope="col" class="right">position</th>
<th scope="col" class="right">shiftedIndex</th>
<th scope="col" class="left">shiftedLetter</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">1</td>
<td class="left">o</td>
<td class="right">14</td>
<td class="right">15</td>
<td class="left">p</td>
</tr>

<tr>
<td class="right">1</td>
<td class="left">d</td>
<td class="right">3</td>
<td class="right">4</td>
<td class="left">e</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-1-13" class="outline-3 badge">
<h3 id="sec-1-13">Badge It - Gold part 1</h3>
<div class="outline-text-3" id="text-1-13">
<ul class="org-ul">
<li>Try to complete the trace table
</li>
<li>You should see that there is a problem with the code.
</li>
<li>Identify the problem and write a description of why the program crashes.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-14" class="outline-3 code">
<h3 id="sec-1-14">Code It</h3>
<div class="outline-text-3" id="text-1-14">
<ul class="org-ul">
<li>As spaces aren't in our alphabet, we need a way of handling them in our code.
</li>
<li>While we're at it, we might as well handle other characters that are not in the alphabet, such as numbers and punctuation.
</li>
<li>We can use <i>conditional selection</i> to achieve this.
</li>
<li>Create a new Python file to practice conditional selection.
</li>
<li>Let's start off in the <i>Interpreter</i>
</li>
<li>Type the following
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">myVar</span> = 10
myVar &lt; 10
</pre>
</div>
<ul class="org-ul">
<li>You should see the word <code>False</code> appear
</li>
<li>Now try the following statements
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python">myVar &gt; 10
<span style="color: #6c71c4;">myVar</span> = 10
</pre>
</div>
<ul class="org-ul">
<li>We can use the fact that these statements evaluate to <code>True</code> or <code>False</code> to make decisions in our program.
</li>
<li>Create a new Python file to practice in. You can delete it later.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">myVar</span> = 10
<span style="color: #859900;">if</span> myVar &gt; 10:
    <span style="color: #859900;">print</span>(<span style="color: #2aa198;">'Greater than 10'</span>)
<span style="color: #859900;">elif</span> myVar &lt; 10:
    <span style="color: #859900;">print</span>(<span style="color: #2aa198;">'Less than 10'</span>)
<span style="color: #859900;">else</span>:
    <span style="color: #859900;">print</span>(<span style="color: #2aa198;">'Equal to 10'</span>)
</pre>
</div>
<ul class="org-ul">
<li>Run this program.
</li>
<li>Conditional statements work by evaluating whether a statement is <code>True</code> or <code>False</code>
</li>
<li>So in the above example, <code>myVar &lt;10</code> evaluates to False.
</li>
<li>Now change the value of myVar and have a look at the results.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-15" class="outline-3 code">
<h3 id="sec-1-15">Code It</h3>
<div class="outline-text-3" id="text-1-15">
<ul class="org-ul">
<li>So how does this help us?
</li>
<li>Try typing the following lines into the interpreter.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">myLetters</span> = <span style="color: #2aa198;">'abcdefg'</span>
<span style="color: #2aa198;">'a'</span> <span style="color: #859900;">in</span> myLetters
<span style="color: #2aa198;">'g'</span> <span style="color: #859900;">in</span> myLetters
<span style="color: #2aa198;">' '</span> <span style="color: #859900;">in</span> myLetters
<span style="color: #2aa198;">'?'</span> <span style="color: #859900;">in</span> myLetters
</pre>
</div>
<ul class="org-ul">
<li>So we can detect if a character is missing from a string of characters and then use conditionals to make different choices.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-16" class="outline-3 badge">
<h3 id="sec-1-16">Badge It - Gold part 2</h3>
<div class="outline-text-3" id="text-1-16">
<ul class="org-ul">
<li>Let's try and use what you have learned to make our program work a little better.
</li>
<li>Use the structured English below to help you build the program in Python.
</li>
</ul>
<pre class="example">
1. For i being every number from 1 through to 26...
2. Set plainText to an empty string
3. For every letter in cipherText
4. If the letter is not in alphabet then set shiftedLetter to letter
5. Else set index to letter's position in the alphabet
6. Set shiftIndex to index + i
7. Set shiftedLetter to the letter at shiftIndex in the alphabet
8. Add the shifted Letter to the plainText
9. Print the plainText once the second For loop ends.
</pre>
<ul class="org-ul">
<li>Run your code again.
</li>
<li>You should get a new error that looks like this.
</li>
</ul>
<pre class="example">
Traceback (most recent call last):
  File "/path/to/python/file.py", line 14, in &lt;module&gt;
    shiftedLetter = alphabet[shiftIndex]
IndexError: string index out of range
</pre>
<ul class="org-ul">
<li>If you don't get that error <code>string index out of range</code> then keep trying or ask for some help.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-17" class="outline-3 try">
<h3 id="sec-1-17">Try It</h3>
<div class="outline-text-3" id="text-1-17">
<ul class="org-ul">
<li>So what does <code>string index out of range</code> mean?
</li>
<li>Let's go back to the <i>interpreter</i> to try and see if we can reproduce the error.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">myString</span> = <span style="color: #2aa198;">'abcdefg'</span>
myString[3]
myString[7]
</pre>
</div>
<ul class="org-ul">
<li>We get the same error. There is no 7th element of the string as we start counting from 0, so the last letter is actually the 6th element.
</li>
<li>We have the same problem in our code.
</li>
<li>As we add <code>i</code> to the letters position, eventually we're going to get a number larger than 25, and there are only positions in our alphabet string are 0..25 
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-18" class="outline-3 learn">
<h3 id="sec-1-18">Learn It</h3>
<div class="outline-text-3" id="text-1-18">
<ul class="org-ul">
<li>Luckily there is a simple operator that can solve this for us.
</li>
<li>If our program is trying to look up the value of the 26th element in the string, we actually want it to find the 0th element of the string. If it's trying to look up the 29th element of the list, we want it to actually look up the 3rd item.
</li>
<li>The modulo operator finds the <i>remainder</i> after division. In Python we use the <code>%</code> symbol.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-19" class="outline-3 try">
<h3 id="sec-1-19">Try It</h3>
<div class="outline-text-3" id="text-1-19">
<ul class="org-ul">
<li>In the interpreter try the following.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python">12 % 26
26 % 26
29 % 26
</pre>
</div>
<ul class="org-ul">
<li>Hopefully you can see how this can help us out. If not, then ask your teacher or a peer for a little help.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-20" class="outline-3 badge">
<h3 id="sec-1-20">Badge It - Platinum</h3>
<div class="outline-text-3" id="text-1-20">
<ul class="org-ul">
<li>Let's try and finish off our program now.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #6c71c4;">alphabet</span> = <span style="color: #2aa198;">'abcdefghijklmnopqrstuvwxyz'</span>
<span style="color: #6c71c4;">cipherText</span> = <span style="color: #2aa198;">'''odmhxf dmzqa, ljqruh wkrvh iluvw wzr zrugv wkhb duh mxvw wkhuh wr </span>
<span style="color: #2aa198;">frqixvh d fudfnhu. dqbzdb wkh vhfuhw phvvdjh lv,</span>
<span style="color: #2aa198;">qrergb hashfwv wkh vsdqlvk lqtxlvlwlrq'''</span>

<span style="color: #859900;">for</span> i <span style="color: #859900;">in</span> <span style="color: #6c71c4;">range</span>(1,26):
    <span style="color: #6c71c4;">plainText</span> = <span style="color: #2aa198;">''</span>
    <span style="color: #859900;">for</span> letter <span style="color: #859900;">in</span> cipherText:
        <span style="color: #859900;">if</span>

        <span style="color: #859900;">else</span>:



        <span style="color: #6c71c4;">plainText</span> += shiftedLetter
    <span style="color: #859900;">print</span>(<span style="color: #2aa198;">'With a shift of'</span>,i,<span style="color: #2aa198;">'the message is\n\n'</span>,plainText,<span style="color: #2aa198;">'\n'</span>)
</pre>
</div>
<ul class="org-ul">
<li>You need to complete the program by completing the conditional statements.
</li>
<li>When you run the program, you should get 25 attempts at decryption, one of which should make sense.
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
